MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K22/mcu.h
extern volatile VREFCON1bits_t VREFCON1bits __at(0xF41);
// bitfield macros
#define _VREFCON1_DACNSS_POSN                               0x0
#define _VREFCON1_DACNSS_POSITION                           0x0
#define _VREFCON1_DACNSS_SIZE                               0x1
#define _VREFCON1_DACNSS_LENGTH                             0x1
#define _VREFCON1_DACNSS_MASK                               0x1
#define _VREFCON1_DACPSS_POSN                               0x2
#define _VREFCON1_DACPSS_POSITION                           0x2
#define _VREFCON1_DACPSS_SIZE                               0x2
#define _VREFCON1_DACPSS_LENGTH                             0x2
#define _VREFCON1_DACPSS_MASK                               0xC
#define _VREFCON1_DACOE_POSN                                0x5
#define _VREFCON1_DACOE_POSITION                            0x5
#define _VREFCON1_DACOE_SIZE                                0x1
#define _VREFCON1_DACOE_LENGTH                              0x1
#define _VREFCON1_DACOE_MASK                                0x20
#define _VREFCON1_DACLPS_POSN                               0x6
#define _VREFCON1_DACLPS_POSITION                           0x6
#define _VREFCON1_DACLPS_SIZE                               0x1
#define _VREFCON1_DACLPS_LENGTH                             0x1
#define _VREFCON1_DACLPS_MASK                               0x40
#define _VREFCON1_DACEN_POSN                                0x7
#define _VREFCON1_DACEN_POSITION                            0x7
#define _VREFCON1_DACEN_SIZE                                0x1
#define _VREFCON1_DACEN_LENGTH                              0x1
#define _VREFCON1_DACEN_MASK                                0x80
#define _VREFCON1_DACPSS0_POSN                              0x2
#define _VREFCON1_DACPSS0_POSITION                          0x2
#define _VREFCON1_DACPSS0_SIZE                              0x1
#define _VREFCON1_DACPSS0_LENGTH                            0x1
#define _VREFCON1_DACPSS0_MASK                              0x4
#define _VREFCON1_DACPSS1_POSN                              0x3
#define _VREFCON1_DACPSS1_POSITION                          0x3
#define _VREFCON1_DACPSS1_SIZE                              0x1
#define _VREFCON1_DACPSS1_LENGTH                            0x1
#define _VREFCON1_DACPSS1_MASK                              0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACNSS                 :1;
        unsigned                        :1;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE                  :1;
        unsigned DACLPS                 :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
} DACCON0bits_t;
extern volatile DACCON0bits_t DACCON0bits __at(0xF41);
// bitfield macros
#define _DACCON0_DACNSS_POSN                                0x0
#define _DACCON0_DACNSS_POSITION                            0x0
#define _DACCON0_DACNSS_SIZE                                0x1
#define _DACCON0_DACNSS_LENGTH                              0x1
#define _DACCON0_DACNSS_MASK                                0x1
#define _DACCON0_DACPSS_POSN                                0x2
#define _DACCON0_DACPSS_POSITION                            0x2
#define _DACCON0_DACPSS_SIZE                                0x2
#define _DACCON0_DACPSS_LENGTH                              0x2
#define _DACCON0_DACPSS_MASK                                0xC
#define _DACCON0_DACOE_POSN                                 0x5
#define _DACCON0_DACOE_POSITION                             0x5
#define _DACCON0_DACOE_SIZE                                 0x1
#define _DACCON0_DACOE_LENGTH                               0x1
#define _DACCON0_DACOE_MASK                                 0x20
#define _DACCON0_DACLPS_POSN                                0x6
#define _DACCON0_DACLPS_POSITION                            0x6
#define _DACCON0_DACLPS_SIZE                                0x1
#define _DACCON0_DACLPS_LENGTH                              0x1
#define _DACCON0_DACLPS_MASK                                0x40
#define _DACCON0_DACEN_POSN                                 0x7
#define _DACCON0_DACEN_POSITION                             0x7
#define _DACCON0_DACEN_SIZE                                 0x1
#define _DACCON0_DACEN_LENGTH                               0x1
#define _DACCON0_DACEN_MASK                                 0x80
#define _DACCON0_DACPSS0_POSN                               0x2
#define _DACCON0_DACPSS0_POSITION                           0x2
#define _DACCON0_DACPSS0_SIZE                               0x1
#define _DACCON0_DACPSS0_LENGTH                             0x1
#define _DACCON0_DACPSS0_MASK                               0x4
#define _DACCON0_DACPSS1_POSN                               0x3
#define _DACCON0_DACPSS1_POSITION                           0x3
#define _DACCON0_DACPSS1_SIZE                               0x1
#define _DACCON0_DACPSS1_LENGTH                             0x1
#define _DACCON0_DACPSS1_MASK                               0x8

// Register: VREFCON0
#define VREFCON0 VREFCON0
extern volatile unsigned char           VREFCON0            __at(0xF42);
#ifndef _LIB_BUILD
asm("VREFCON0 equ 0F42h");
#endif
// aliases
extern volatile unsigned char           FVRCON              __at(0xF42);
#ifndef _LIB_BUILD
asm("FVRCON equ 0F42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned FVRS                   :2;
        unsigned FVRST                  :1;
        unsigned FVREN                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned FVRS0                  :1;
        unsigned FVRS1                  :1;
    };
} VREFCON0bits_t;
extern volatile VREFCON0bits_t VREFCON0bits __at(0xF42);
// bitfield macros
#define _VREFCON0_FVRS_POSN                                 0x4
#define _VREFCON0_FVRS_POSITION                             0x4
#define _VREFCON0_FVRS_SIZE                                 0x2
#define _VREFCON0_FVRS_LENGTH                               0x2
#define _VREFCON0_FVRS_MASK                                 0x30
#define _VREFCON0_FVRST_POSN                                0x6
#define _VREFCON0_FVRST_POSITION                            0x6
#define _VREFCON0_FVRST_SIZE                                0x1
#define _VREFCON0_FVRST_LENGTH                              0x1
#define _VREFCON0_FVRST_MASK                                0x40
#define _VREFCON0_FVREN_POSN                                0x7
#define _VREFCON0_FVREN_POSITION                            0x7
#define _VREFCON0_FVREN_SIZE                                0x1
#define _VREFCON0_FVREN_LENGTH                              0x1
#define _VREFCON0_FVREN_MASK                                0x80
#define _VREFCON0_FVRS0_POSN                                0x4
#define _VREFCON0_FVRS0_POSITION                            0x4
#define _VREFCON0_FVRS0_SIZE                                0x1
#define _VREFCON0_FVRS0_LENGTH                              0x1
#define _VREFCON0_FVRS0_MASK                                0x10
#define _VREFCON0_FVRS1_POSN                                0x5
#define _VREFCON0_FVRS1_POSITION                            0x5
#define _VREFCON0_FVRS1_SIZE                                0x1
#define _VREFCON0_FVRS1_LENGTH                              0x1
#define _VREFCON0_FVRS1_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned FVRS                   :2;
        unsigned FVRST                  :1;
        unsigned FVREN                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned FVRS0                  :1;
        unsigned FVRS1                  :1;
    };
} FVRCONbits_t;
extern volatile FVRCONbits_t FVRCONbits __at(0xF42);
// bitfield macros
#define _FVRCON_FVRS_POSN                                   0x4
#define _FVRCON_FVRS_POSITION                               0x4
#define _FVRCON_FVRS_SIZE                                   0x2
#define _FVRCON_FVRS_LENGTH                                 0x2
#define _FVRCON_FVRS_MASK                                   0x30
#define _FVRCON_FVRST_POSN                                  0x6
#define _FVRCON_FVRST_POSITION                              0x6
#define _FVRCON_FVRST_SIZE                                  0x1
#define _FVRCON_FVRST_LENGTH                                0x1
#define _FVRCON_FVRST_MASK                                  0x40
#define _FVRCON_FVREN_POSN                                  0x7
#define _FVRCON_FVREN_POSITION                              0x7
#define _FVRCON_FVREN_SIZE                                  0x1
#define _FVRCON_FVREN_LENGTH                                0x1
#define _FVRCON_FVREN_MASK                                  0x80
#define _FVRCON_FVRS0_POSN                                  0x4
#define _FVRCON_FVRS0_POSITION                              0x4
#define _FVRCON_FVRS0_SIZE                                  0x1
#define _FVRCON_FVRS0_LENGTH                                0x1
#define _FVRCON_FVRS0_MASK                                  0x10
#define _FVRCON_FVRS1_POSN                                  0x5
#define _FVRCON_FVRS1_POSITION                              0x5
#define _FVRCON_FVRS1_SIZE                                  0x1
#define _FVRCON_FVRS1_LENGTH                                0x1
#define _FVRCON_FVRS1_MASK                                  0x20

