MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K22/mcu.h
extern volatile PORTEbits_t PORTEbits __at(0xF84);
// bitfield macros
#define _PORTE_RE0_POSN                                     0x0
#define _PORTE_RE0_POSITION                                 0x0
#define _PORTE_RE0_SIZE                                     0x1
#define _PORTE_RE0_LENGTH                                   0x1
#define _PORTE_RE0_MASK                                     0x1
#define _PORTE_RE1_POSN                                     0x1
#define _PORTE_RE1_POSITION                                 0x1
#define _PORTE_RE1_SIZE                                     0x1
#define _PORTE_RE1_LENGTH                                   0x1
#define _PORTE_RE1_MASK                                     0x2
#define _PORTE_RE2_POSN                                     0x2
#define _PORTE_RE2_POSITION                                 0x2
#define _PORTE_RE2_SIZE                                     0x1
#define _PORTE_RE2_LENGTH                                   0x1
#define _PORTE_RE2_MASK                                     0x4
#define _PORTE_RE3_POSN                                     0x3
#define _PORTE_RE3_POSITION                                 0x3
#define _PORTE_RE3_SIZE                                     0x1
#define _PORTE_RE3_LENGTH                                   0x1
#define _PORTE_RE3_MASK                                     0x8
#define _PORTE_AN5_POSN                                     0x0
#define _PORTE_AN5_POSITION                                 0x0
#define _PORTE_AN5_SIZE                                     0x1
#define _PORTE_AN5_LENGTH                                   0x1
#define _PORTE_AN5_MASK                                     0x1
#define _PORTE_AN6_POSN                                     0x1
#define _PORTE_AN6_POSITION                                 0x1
#define _PORTE_AN6_SIZE                                     0x1
#define _PORTE_AN6_LENGTH                                   0x1
#define _PORTE_AN6_MASK                                     0x2
#define _PORTE_AN7_POSN                                     0x2
#define _PORTE_AN7_POSITION                                 0x2
#define _PORTE_AN7_SIZE                                     0x1
#define _PORTE_AN7_LENGTH                                   0x1
#define _PORTE_AN7_MASK                                     0x4
#define _PORTE_MCLR_POSN                                    0x3
#define _PORTE_MCLR_POSITION                                0x3
#define _PORTE_MCLR_SIZE                                    0x1
#define _PORTE_MCLR_LENGTH                                  0x1
#define _PORTE_MCLR_MASK                                    0x8
#define _PORTE_NOT_MCLR_POSN                                0x3
#define _PORTE_NOT_MCLR_POSITION                            0x3
#define _PORTE_NOT_MCLR_SIZE                                0x1
#define _PORTE_NOT_MCLR_LENGTH                              0x1
#define _PORTE_NOT_MCLR_MASK                                0x8
#define _PORTE_P3A_POSN                                     0x0
#define _PORTE_P3A_POSITION                                 0x0
#define _PORTE_P3A_SIZE                                     0x1
#define _PORTE_P3A_LENGTH                                   0x1
#define _PORTE_P3A_MASK                                     0x1
#define _PORTE_P3B_POSN                                     0x1
#define _PORTE_P3B_POSITION                                 0x1
#define _PORTE_P3B_SIZE                                     0x1
#define _PORTE_P3B_LENGTH                                   0x1
#define _PORTE_P3B_MASK                                     0x2
#define _PORTE_CCP5_POSN                                    0x2
#define _PORTE_CCP5_POSITION                                0x2
#define _PORTE_CCP5_SIZE                                    0x1
#define _PORTE_CCP5_LENGTH                                  0x1
#define _PORTE_CCP5_MASK                                    0x4
#define _PORTE_nMCLR_POSN                                   0x3
#define _PORTE_nMCLR_POSITION                               0x3
#define _PORTE_nMCLR_SIZE                                   0x1
#define _PORTE_nMCLR_LENGTH                                 0x1
#define _PORTE_nMCLR_MASK                                   0x8
#define _PORTE_CCP3_POSN                                    0x0
#define _PORTE_CCP3_POSITION                                0x0
#define _PORTE_CCP3_SIZE                                    0x1
#define _PORTE_CCP3_LENGTH                                  0x1
#define _PORTE_CCP3_MASK                                    0x1
#define _PORTE_VPP_POSN                                     0x3
#define _PORTE_VPP_POSITION                                 0x3
#define _PORTE_VPP_SIZE                                     0x1
#define _PORTE_VPP_LENGTH                                   0x1
#define _PORTE_VPP_MASK                                     0x8
#define _PORTE_PD2_POSN                                     0x0
#define _PORTE_PD2_POSITION                                 0x0
#define _PORTE_PD2_SIZE                                     0x1
#define _PORTE_PD2_LENGTH                                   0x1
#define _PORTE_PD2_MASK                                     0x1
#define _PORTE_PC2_POSN                                     0x1
#define _PORTE_PC2_POSITION                                 0x1
#define _PORTE_PC2_SIZE                                     0x1
#define _PORTE_PC2_LENGTH                                   0x1
#define _PORTE_PC2_MASK                                     0x2
#define _PORTE_CCP10_POSN                                   0x2
#define _PORTE_CCP10_POSITION                               0x2
#define _PORTE_CCP10_SIZE                                   0x1
#define _PORTE_CCP10_LENGTH                                 0x1
#define _PORTE_CCP10_MASK                                   0x4
#define _PORTE_CCP9E_POSN                                   0x3
#define _PORTE_CCP9E_POSITION                               0x3
#define _PORTE_CCP9E_SIZE                                   0x1
#define _PORTE_CCP9E_LENGTH                                 0x1
#define _PORTE_CCP9E_MASK                                   0x8
#define _PORTE_RDE_POSN                                     0x0
#define _PORTE_RDE_POSITION                                 0x0
#define _PORTE_RDE_SIZE                                     0x1
#define _PORTE_RDE_LENGTH                                   0x1
#define _PORTE_RDE_MASK                                     0x1
#define _PORTE_WRE_POSN                                     0x1
#define _PORTE_WRE_POSITION                                 0x1
#define _PORTE_WRE_SIZE                                     0x1
#define _PORTE_WRE_LENGTH                                   0x1
#define _PORTE_WRE_MASK                                     0x2
#define _PORTE_CS_POSN                                      0x2
#define _PORTE_CS_POSITION                                  0x2
#define _PORTE_CS_SIZE                                      0x1
#define _PORTE_CS_LENGTH                                    0x1
#define _PORTE_CS_MASK                                      0x4
#define _PORTE_PC3E_POSN                                    0x3
#define _PORTE_PC3E_POSITION                                0x3
#define _PORTE_PC3E_SIZE                                    0x1
#define _PORTE_PC3E_LENGTH                                  0x1
#define _PORTE_PC3E_MASK                                    0x8
#define _PORTE_PB2_POSN                                     0x2
#define _PORTE_PB2_POSITION                                 0x2
#define _PORTE_PB2_SIZE                                     0x1
#define _PORTE_PB2_LENGTH                                   0x1
#define _PORTE_PB2_MASK                                     0x4

